Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཡང་དག་འཕགས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days I was the bodhisattva called Truly Noble Radiance.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings should cultivate knowledge of the origin as related to knowledge of the world.

source: མཽད་གལ་གྱི་བུ་ངས་གཞན་ཡང་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of the world.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། གཙོ་བོའི་བུ་མྱ་ངན་སེལ་ཅེས་བྱ་བ་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a young lord named Reliever of Suffering who had served previous victors.

source: འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་མངོན་པར་རྫོགས་པར་ཤེས་ནས་ཡང་དག་པར་བཤད་པར་བྱའོ་སྙམ་མོ། །
en: ‘I should come to fully understand knowledge of the origin as related to knowledge of the world, and then go on to teach about it.’

source: འཇིག་རྟེན་ན་དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་སུ་ཡོད།
en: ‘Which ascetic or brahmin now lives in the world who accurately understands knowledge of the origin as related to knowledge of the world?

source: དེ་ལ་བདག་ཡོངས་སུ་དྲིའོ་སྙམ་མོ། །
en: I will ask whomever that may be.’

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་དབྱངས་སྒྲོགས་ཞེས་བྱ་བ་ནས།
en: At that time there had appeared in the world a thus-gone one named Nectar Proclaimer;

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་དབྱངས་སྒྲོགས་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་གཙོ་བོའི་བུ་མྱ་ངན་སེལ་བ་དེ་བྱུང་ངོ་། །
en: The young lord Reliever of Suffering then took birth in the buddha realm of the thus-gone Nectar Proclaimer.

source: དེ་ནས་གཙོ་བོའི་བུ་མྱ་ངན་སེལ་སྐྱེས་མ་ཐག་པའི་སྔོན་གྱི་གཉེན་རྙིང་པ་ལྷ་སྙིང་རྗེ་ཅན་དེས་བར་སྣང་ལ་འདུག་སྟེ། ལུས་སྣང་བར་བྱས་ནས་གཙོ་བོའི་བུ་སྙིང་རྗེ་ཅན་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: As soon as the young lord Reliever of Suffering was born there, a benevolent god who was his long-term friend manifested in midair, allowed his body to become visible, and then spoke these verses to the compassionate young lord:

source: འཇིག་རྟེན་མགོན་པོ་བདུད་རྩིའི་དབྱངས་སྒྲོགས་པ། །
en: “ ‘Nectar Proclaimer, the Guardian of the World,

source: གཟི་བརྗིད་མཐའ་ཡས་སྟོབས་བཅུ་མངའ་བ་འདི། །
en: Possesses the ten powers and infinite majesty.

source: འགྲོ་ལ་ཕན་པ་དཔག་ཏུ་མེད་པ་སྤྱོད། །
en: He carries out immeasurable benefit for beings;

source: འགྲོ་བའི་ཐེ་ཚོམ་སེལ་ཅིང་གཅོད་པར་མཛད། །
en: He dispels and eliminates the doubts of beings.

source: གང་གིས་ལག་མཐིལ་སྐྱུ་རུ་ར་བཞག་ལྟར། །དེ་བཞིན་ལྷ་དང་མི་ཡི་བསམ་པ་གཟིགས། །
en: “ ‘He perceives the thoughts of gods and humans As clearly as a gooseberry placed in the palm of his hand.

source: གང་དག་འདས་དང་མ་འོངས་ད་ལྟར་བྱུང་། །འགྲོ་བ་འདི་དག་ད་ལྟ་ཤིན་ཏུ་མཁྱེན། །
en: He perfectly knows in the present Of any beings of the past, present, or future.

source: བདེ་བར་གཤེགས་པ་ལྷ་མིའི་མཆོད་པའི་གནས། །
en: “ ‘This Blissful One, worthy of the reverence of gods and humans,

source: དྲང་སྲོང་མགོན་པོ་སྡུག་བསྔལ་རྣམས་ལ་བརྩེ། །
en: This sage and protector cares for those who suffer.

source: རྟག་ཏུ་འགྲོ་བའི་ཡིད་ལ་བྱེད་པ་མཁྱེན། །
en: He is always aware of what is happening in beings’ minds.

source: ཇི་ལྟར་ནོར་མཁན་རིན་ཆེན་ནོར་བུའི་སྐྱོན། །
en: “ ‘Like a jeweler recognizes the flaws in a jewel,

source: རབ་ཏུ་ཤེས་ཤིང་དུག་སྐྱོན་ཤེས་ལྡན་ལྟར། །
en: Or as one who knows the harm of poison, so too,

source: དེ་བཞིན་སྟོབས་བཅུ་འགྲོ་བའི་བསམ་པ་མཁྱེན། །
en: With his ten powers, does he know the minds of beings.

source: ཐུགས་རྗེ་དཔེ་མེད་དག་ནི་བསྐྱེད་ནས་སུ། །
en: Arousing unparalleled compassion,

source: འདོད་ཆགས་དུག་གིས་བསྐྱེད་པའི་མི་གང་འདི། །རབ་ཏུ་རྨོངས་པས་ཉལ་ལ་གསོ་སྨན་བྱ། །
en: “ ‘He will cure anyone who is asleep in delusion And who has taken birth due to the poison of desire.

source: ཞེ་སྡང་དྲག་པོའི་དུག་གིས་བསྐྱེད་པ་གང་། །དེ་ལ་བདག་གིས་བྱམས་བསྐྱེད་གསོ་སྨན་བྱ། །
en: He will apply the remedy of arousing loving kindness For anyone who has taken birth due to the poison of intense anger.

source: གཏི་མུག་དྲག་པའི་དུག་ནི་འཇིགས་ཆེན་གྱིས། །མི་ཡི་སེམས་ཀྱི་རྗེས་སུ་སོང་བ་གང་། །དེ་ལ་བདག་གིས་དུག་མེད་ནད་མེད་བྱ། །
en: “ ‘He will cure and restore to health Anyone whose mind is suffused With the dangerous poison of severe ignorance.

source: དེ་རིང་དུག་དག་བཅོམ་སྟེ་དུག་མེད་བྱ། །
en: Today he will vanquish and antidote such poison.

source: ཇི་ལྟར་བདག་ནི་ཐེ་ཚོམ་མི་འགྱུར་བར། །ཐེ་ཚོམ་དེ་ནི་ཁྱོད་ཀྱིས་བསལ་བར་སྤྱོད། །
en: “ ‘Just as I have no doubts at all, You should eliminate your doubts as well.

source: ལྷ་མི་ཐེ་ཚོམ་ཡིད་གཉིས་སྐྱེས་པས་འཇིག །
en: Gods and men are tormented by reservations.

source: རང་བྱུང་དེ་ལ་འདི་དག་ཞུ་བར་གྱིས། །
en: You should ask your questions to the Self-Manifest One!’

source: དེ་ནས་དེ་ཡི་ཡིད་འོང་ཚིག་ཐོས་ཤིང་། །བདག་ཉིད་ཚེ་ལྷ་ནམ་མཁར་འདུག་མཐོང་ནས། །སོར་བཅུའི་ཐལ་མོ་སྤྱི་བོར་སྦྱར་བྱས་ཏེ། །ནམ་མཁར་འདུག་པའི་ལྷ་ལ་སངས་རྒྱས་འདྲི། །
en: “Hearing these beautiful words, and seeing The god of longevity there in the sky, He brought his ten fingers together at his crown, And asked about the Buddha to the god in the sky:

source: ཐེ་ཚོམ་དཔག་མེད་གཅོད་པའི་སངས་རྒྱས་ནི། །གང་ན་བཞུགས་ཤིང་བདག་ནི་གང་ཕྱོགས་མཆི། །
en: “ ‘Where is this Buddha who cuts through innumerable doubts? Where should I go?

source: མི་མཆོག་གཙོ་བོ་ཐུབ་པ་སྟོབས་བཅུ་ལྡན། །དེ་དྲུང་བདག་མཆི་དོན་ནི་ཐོབ་པར་བགྱི། །
en: I will go before this foremost man, this chief, This sage with ten powers, and achieve my aims.’

source: སྟོབས་བཅུ་ལྡན་པ་ཤར་ཕྱོགས་རྒྱལ་པོའི་ཁབ། །ཞི་བ་རྙིང་པ་ཞེས་བྱ་དེ་ན་བཞུགས། །ལྷ་དང་མི་ཡི་ཐེ་ཚོམ་གཅོད་མཛད་ཀྱིས། །
en: “ ‘The One with Ten Powers is dwelling to the east In a kingdom called Ancient Peace, Where he dispels the doubts of gods and men.

source: སོང་ལ་རང་བྱུང་རྒྱལ་ལ་ལ་རབ་ཞུས་ཤིག །
en: Go there, and ask your questions to the Self-Manifest Victor!’

source: དེ་ནས་གཙོ་བོའི་བུ་མྱ་ངན་སེལ་གྱིས་ལྷ་དེའི་ཚིག་ཐོས་ནས་དེའི་མཚན་མོ་འདས་ཏེ
en: “The young lord Reliever of Suffering heard what the god said and then waited for the night to pass.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དྲུག་ཅུ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུད་རྩིའི་དབྱངས་སྒྲོགས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: He then traveled to the presence of the thus-gone, worthy, perfect buddha Nectar Proclaimer along with sixty sextillion other beings.

source: གཙོ་བོའི་བུ་མྱ་ངན་སེལ་བས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་དབྱངས་སྒྲོགས་མཛེས་པ་དང་། མཛེས་པ་སྡུག་པ་དང་།
en: The young lord Reliever of Suffering then saw how stunning and handsome the thus-gone Nectar Proclaimer was;

source: དབང་པོ་ཞི་ཐུགས་ཞི་དུལ་བ་དང་ཞི་གནས་མཆོག་ནི་བརྙེས།
en: how calm his faculties were, how calm and gentle his mind was, and what an exalted state of tranquility he had achieved;

source: དུལ་བ་དང་ཞི་གནས་དམ་པ་ནི་བརྙེས་སྦས་པ། གླང་པོ་དབང་པོ་ནི་དུལ།
en: how he kept his attainment of sublime calmness and tranquility hidden; how his senses were gentle as an elephant;

source: མཚོ་ལྟར་དང་ཞིང་རྙོག་མ་མེད་ལ་རབ་ཏུ་གསལ་བར་མཐོང་ངོ་། །
en: and, like a lake, how bright, uncontaminated, and radiant he was.

source: མཐོང་ནས་དེ་བཞིན་གཤེགས་པ་དེའི་དྲུང་དུ་གཞལ་དུ་མེད་པའི་དགའ་བ་སྐྱེས་ཏེ།
en: Upon beholding him, he felt immeasurable joy just to be in the Thus-Gone One’s presence.

source: དེ་རེ་ཤིག་ཆོས་མི་ཉན་ཏོ། །
en: For a moment he did not even listen to the teaching.

source: དེ་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He just thought,

source: ཁྱོད་ཀྱི་ཡེ་ཤེས་ཅི་འདྲ་བར་བདག་ཀྱང་དེ་འདྲ་བར་གྱུར་ཅིག །
en: ‘May I attain exactly the same wisdom as you.

source: ཁྱོད་ཀྱི་སྐུ་དང་གསུང་ཅི་འདྲ་བར་བདག་ཀྱང་དེ་འདྲ་བར་གྱུར་ཅིག་སྙམ་མོ། །
en: May my body and speech become exactly like yours.’

source: དེ་བཞིན་གཤེགས་པས་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: The Thus-Gone One then prophesied his unsurpassed and completely perfect awakening.

source: དེས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་དབྱངས་སྒྲོགས་དེ་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མེ་ཏོག་གིས་གང་བའི་སྐོན་པ་སྟོང་མངོན་པར་གཏོར་ནས་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་པ།
en: The young lord then presented the thus-gone Nectar Proclaimer with a thousand baskets filled with flowers of the seven precious substances, before praising him with this verse:

source: ཇི་ལྟར་ཐོས་པ་དེ་བཞིན་མཐོང་སྟེ་དེ་བས་ལྷག་པར་བཟང་། །
en: “ ‘You look just as I have heard, only even more magnificent.

source: འདི་ལྟར་ཁྱོད་ལ་སྐྱབས་མཆི་རྐང་གཉིས་མཆོག་འགྱུར་བགྱི། །
en: Thus I take you as my refuge, most eminent human.

source: དགེ་བའི་རྩ་བ་འདི་ཡིས་མི་ཡི་འདྲེན་གྱུར་ནས། །སེམས་ཅན་མགོན་མེད་སྐྱབས་མེད་སྡུག་བསྔལ་དགྲོལ་བར་བགྱི། །
en: By these roots of virtue, may I become a guide for people, And liberate helpless, defenseless beings from suffering.’

source: དེའི་ཚེ་དེའི་དུས་ན་གཙོ་བོའི་བུ་མྱ་ངན་སེལ་ཅེས་བྱ་བར་གྱུར་པ་དེ་བཞིན་གཤེགས་པ་གང་ལ་ཡོངས་སུ་ཞུ་བ་ལ་འོངས་ནསམཐོང་བ་ཙམ་ཉིད་ཀྱིས་ཐེ་ཚོམ་དང་བྲལ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time the young lord Reliever of Suffering—who went before the Thus-Gone One to ask questions, and lost all his doubts just upon beholding him—was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་གཙོ་བོའི་བུ་མྱ་ངན་སེལ་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the young lord Reliever of Suffering.

source: གང་ལ་ཞུས་པ་ཙམ་ཉིད་ཀྱིས་ཐེ་ཚོམ་དང་བྲལ་ཏེ།
en: Just by asking his questions to the Thus-Gone One, he became free of doubts.

source: དེས་ན་ང་དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་བ་ཙམ་གྱིས་དད་པས་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་བསྒྲུབས་སོ། །
en: Consequently, as soon as he saw the Thus-Gone One, he felt faith and accomplished knowledge of the origin as related to knowledge of the world.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ཉིད་མཐོང་བར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings should behold the Thus-Gone One.

source: མཽད་གལ་གྱི་བུ་དེ་ཉིད་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ལ་དད་པ་བསྐྱེད་པར་བྱ།
en: Maudgalyāyana, when beholding him, bodhisattvas should engender faith in the Buddha.

source: འཇིག་རྟེན་པའི་ཤེས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: They should apply themselves to realizing worldly knowledge.

source: མཽད་གལ་གྱི་བུ་ངས་འཇིག་རྟེན་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་འཇིག་རྟེན་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་པར་རྫོགས་པར་ཤེས་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་སྙམ་ནས།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, in order to understand cessation as related to the world, I wondered, ‘How can I come to perfectly understand knowledge of cessation as related to knowledge of the world, and then explain about it to sentient beings?’ With that thought in mind,

source: དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: I created numerous different roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་གྲོ་ཞིན་སྐྱེས་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Śroṇakoṭi.

source: དེ་དབེན་པར་སོང་ནས་ནང་དུ་ཡང་དག་འཇོག་ལ་འཇུག་སྟེ།
en: He went to an isolated place and sequestered himself in solitude.

source: འདི་སྙམ་དུ་སེམས་སོ། །
en: He began to contemplate,

source: གང་སྲོག་ཆགས་དང་སྲོག་ཆགས་མ་ཡིན་པ་དེ་དག་སྲིད་པ་ལ་ཇི་ལྟར་འགྲོ་སྙམ་མོ། །
en: ‘How do living beings and those that have died migrate in existence?’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ་བདག་དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་དག་གི་དྲུང་དུ་སོང་སྟེ་གང་ཡིན་པ་ཡོངས་སུ་དྲི་བར་བྱ་སྙམ་མོ། །
en: He then had the thought, ‘I must pay visits to ascetics and brahmins and ask them about this matter.’

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་ཞེས་བྱ་བ་ནས།
en: “At that time there had appeared in the world a thus-gone one named Lokapradīpa;

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་སྒྲོན་མ་དེ་ཞེས་བྱ་བ་ནས་དེ་མི་མཁྱེན་པའམ། མ་གཟིགས་པའམ། ཐུགས་སུ་མ་ཆུད་པའམ། མངོན་སུམ་དུ་མ་མཛད་པའམ། མངོན་པར་རྫོགས་པར་ཐུགས་སུ་མ་ཆུད་པ་ཅི་ཡང་མེད་དེདེ་བདག་གི་འདི་འཆད་དོ་ཞེས་བྱ་བའི་བར་དེ་ལྟ་བུའི་སྒྲ་མངོན་པར་ཕྱུང་ངོ་། །
en: The thus-gone Lokapradīpa had declared, ‘There is nothing that I, the thus-gone, worthy, perfect buddha Lokapradīpa, have not understood, perceived, recognized, actualized, or realized. I will explain this!’

source: དེ་ནས་དྲང་སྲོང་གྲོ་ཞིན་སྐྱེས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་སོང་ནས་ཡོངས་སུ་ཞུ་བར་བྱ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེ་ཇི་ལྟ་བཞིན་དུ་ལུང་སྟོན་པར་མཛད་དེ། དེའི་དོན་དེ་བཞིན་དུ་གཟུང་བར་བྱའོ་སྙམ་ནས།
en: So Śroṇakoṭi the sage thought to himself, ‘I ought to go before the Thus-Gone One and ask him my questions. The blessed Thus-Gone One will surely give a precise answer, and I will bear its significance in mind.’

source: དེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ཏོ། །
en: Thus he went off to pay a visit to the blessed thus-gone Lokapradīpa.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་དེ་མཐོང་ནས་གཞལ་དུ་མེད་པའི་དད་པ་ཐོབ་སྟེ།
en: Upon seeing the blessed thus-gone Lokapradīpa, he felt immeasurable faith.

source: སེམས་རབ་ཏུ་དང་བས་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: With an utterly serene state of mind, he bowed his head to the Thus-Gone One’s feet, and then sat off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དྲང་སྲོང་གྲོ་ཞིན་སྐྱེས་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་སྒྲོན་མ་དེ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Sitting off to the side, Śroṇakoṭi the sage then proceeded to ask the Thus-Gone One questions in these verses:

source: མི་མཆོག་བདེ་གཤེགས་སེམས་ཅན་གང་དག་སྲིད་པར་སྐྱེ། །དེ་དག་ཚོགས་རྣམས་གར་མཆི་འདྲེན་པ་བདག་ལ་གསུངས། །
en: “ ‘Foremost of humans, Blissful One—these beings born into existence, Where do they gather? Please tell me, O Guide.

source: དངོས་པོ་འདི་ཀུན་རྒྱུ་མེད་པ་ཞེས་ཁ་ཅིག་མཆི། །བདག་གི་རང་བཞིན་སྐྱེ་སྟེ་འགྲོ་བར་དེ་བཞིན་མཆི། །
en: Some say that all these material things are causeless, That they are formed by themselves, and thus do they pass and exist:

source: ས་ནི་ས་རུ་མཆི་ཞིང་ཆུ་ཡང་ཆུ་རུ་མཆི། །མེ་ནི་མེ་རུ་མཆི་ཞིང་རླུང་ཡང་རླུང་དུ་མཆི། །
en: “ ‘That earth exists in earth, and water in water; That fire exists in fire, and wind in wind;

source: འབྱུང་བའི་ཚོགས་པ་མ་གཏོགས་དེ་ལས་གཞན་མ་མཆིས། །
en: Or that there is nothing other than a gathering of elements.

source: དེར་ནི་རྣམ་ཤེས་མཐོང་སྟེ་འདི་ལྟར་རྣམ་ཤེས་སྣང་། །
en: Within them consciousness is perceived, and so consciousness manifests.

source: ཁ་ཅིག་འདི་སྐད་མཆི་སྟེ་གཟུགས་ལ་སེམས་ཐོགས་མེད། །
en: “ ‘Some say mind exists, that it is unimpeded by the body.

source: ལྡོག་པ་ག་ལས་འབྱུང་བ་འདི་ཀུན་མི་འཚལ་ན། །
en: As I do not know any of these things—which things bring them about—

source: ཇི་ལྟར་བདག་ནི་ཐེ་ཚོམ་མེད་ཅིང་ཆོས་ཀུན་མཁས། །
en: So that I may become free of doubts and knowledgeable about everything,

source: མི་མཆོག་བདག་གི་ཐེ་ཙོམ་དེ་དག་དགུམ་པ་གསུངས། །
en: Foremost of humans, please eradicate my doubts!’

source: སྒྲོན་མ་གང་ཟག་མཆོག་གི་མཁྱེན་པས་དེ་ལུང་བསྟན། །
en: “Lokapradīpa replied out of his wisdom as a supreme person:

source: གྲོ་ཞིན་དེས་པས་གང་ཞུས་བཤད་ཀྱིས་ང་ལ་ཉོན། །
en: ‘Noble Śroṇakoṭi, I will answer your question, so listen to what I say.

source: གཟུགས་དང་ཚོར་བ་འདུ་ཤེས་སེམས་པ་སེམས་དང་ལྔ། །འདི་དག་བརྟེན་ནས་འབྱུང་སྟེ་འོང་བ་དེ་དག་མེད། །
en: Form, feeling, perception, intention, and mind Arise dependently—they have no “coming.”

source: ཇི་ལྟར་ནམ་མཁའི་སྤྲིན་ནི་བྱུང་ནས་ཞིག་ཅིང་མེད། །དེ་ལྟར་འགྲོ་དང་མི་འགྲོ་མེད་པའི་ཆོས་ཤེས་བྱོས། །
en: “ ‘Like clouds in the sky—forming, then receding and vanishing— Understand phenomena to be the same, neither going nor not going.’

source: དེ་ནས་དྲང་སྲོང་གྲོ་ཞིན་སྐྱེས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Śroṇakoṭi the sage then thought to himself,

source: ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པ་ནི་མཁྱེན་པ་མཉམ་སྟེ།
en: ‘How much wisdom one must have to equal the Thus-Gone One!

source: གང་གིས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་གཟིགས་པ་ནི་ངོ་མཚར་ཏོ། །
en: It is remarkable that someone can perceive the true nature of things like this.

source: ཆོས་དེ་དག་ཀྱང་གང་ནས་ཀྱང་མི་འོང་ལ་གང་དུ་ཡང་མི་འགྲོ།
en: These phenomena neither come nor go, and yet they appear to go.

source: འགྲོ་བར་ཡང་སྣང་ལ། རྒྱུ་མེད་པ་ལས་ཀྱང་མི་སྐྱེ།
en: They are not born without a cause.

source: གར་ཡང་མི་སྐྱེ་ལ་འགོག་པ་ཡང་མེད་འགྲོ་བ་ཡང་མེད་དོ་སྙམ་ནས།
en: Where there is no birth, there is no cessation and no going.’

source: དེ་དད་པ་མཆོག་དང་ལྡན་པས་སེམས་བསྐྱེད་དེ།
en: With this in mind, he felt the utmost faith, and resolved,

source: བདག་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འདི་དང་ལྡན་ནས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་དག་ཉིད་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་གྱུར་ཅིག །
en: ‘In the future may I attain the same wisdom as the Thus-Gone One, and with it, teach sentient beings about the nature of phenomena.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་གྲོ་ཞིན་སྐྱེས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “What do you think, Maudgalyāyana? In case you may think that at that time Śroṇakoṭi the sage was anyone else, Maudgalyāyana, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་གྲོ་ཞིན་སྐྱེས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འཇིག་རྟེན་གྱི་མཆོད་རྟེན་དུ་གྱུར་ཏོ། །
en: Because in those days I was Śroṇakoṭi the sage, who was the object of the world’s reverence.

source: དགེ་བའི་རྩ་བ་དེས་ང་འཇིག་རྟེན་ཤེས་པ་འགོག་པ་ཤེས་པ་བརྙེས་སོ། །
en: Due to those roots of virtue I attained knowledge of cessation as related to knowledge of the world.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings should endeavor to understand cessation as related to knowledge of the world.

source: མཽད་གལ་གྱི་བུ་འཇིག་རྟེན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་བདག་འཇིག་རྟེན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་མངོན་པར་རྫོགས་པར་ཤེས་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས
en: “Maudgalyāyana, in order to understand the path that leads to cessation as related to knowledge of the world, I once had the thought, ‘How can I come to perfectly understand the path that leads to cessation as related to knowledge of the world, and then go on to teach such knowledge to sentient beings?’ With that thought in mind,

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་འོད་བྱེད་ཅེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a spiritually inclined king named Radiant.

source: རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་སྟེ། དེའི་རིན་པོ་ཆེ་སྣ་བདུན་ནི་འདི་ལྟ་སྟེ། འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བློན་པོ་རིན་པོ་ཆེ་སྟེ། རིན་པོ་ཆེ་འདི་བདུན་ནོ། །
en: He held the seven treasures: the precious wheel, the precious elephant, the precious horse, the precious jewel, the precious queen, the precious steward, and the precious minister.

source: བུ་ཡང་སྟོང་ཐམ་པ་བྱུང་སྟེ་དཔའ་ཞིང་རྟུལ་ཕོད་ལ་ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ་ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པའོ། །
en: He also had one thousand sons, all of whom were brave, heroic, and athletic, and able to conquer all opposing forces.

source: དེ་སའི་དཀྱིལ་འཁོར་ཆེན་པོ་འདི་ཉིད་ཆད་པ་མེད་ཅིང་ཚོན་གྱིས་བདའ་བ་མེད་ལ། རང་གི་ཆོས་ཀྱིས་ཤིན་ཏུ་གནས་སོ། །
en: The king governed the entire earth by his religion and without the use of violent force.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་ཞི་བ་ཞེས་བྱ་བ་རབ་ཏུ་བྱུང་བའི་ཚོགས་དགེ་འདུན་དཔག་ཏུ་མེད་པའི་འཁོར་དང་། དགེ་བསྙེན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པའི་འཁོར་དང་། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པའི་འཁོར་དང་། ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པའི་འཁོར་བྱུང་ངོ་། །
en: At that time there was a thus-gone one named Peaceful Action whose retinue included a gathering of innumerably many ordained monks, a gathering of countless tens of thousands of laypeople, a gathering of countless sextillions of gods, and a gathering of countless sextillions of nāgas.

source: དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་ཞི་བ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་སྤྱོད་པ་འདི་ལྟ་བུ་བྱུང་སྟེ། འདི་ལྟ་སྟེ་དཔེར་ན། བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ཀྱི་ཚེའི་ཚད་དུ་སེམས་ཅན་དེ་དག་གི་ཚེའི་ཚད་དེ་བཞིན་ངེས་ཏེ།
en: In the thus-gone Peaceful Action’s buddha realm, beings’ life spans were fixed like those in the northern continent of Kuru.

source: ལོ་སྟོང་དུ་ཚེའི་ཚད་ངེས་པ་ནི་མ་ཡིན་ལ་ཚེ་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། །
en: However, their life span was not fixed at just one thousand years—their lives were immeasurably long.

source: དེ་ཚེའི་ཚད་དུ་མ་ཕྱིན་པར་བར་དུ་འཆི་བའི་དུས་མི་བྱེད་དོ། །
en: They never died until they reached the full extent of their life span.

source: དེ་རྒྱལ་པོ་འོད་བྱེད་བློན་པོ་བདུན་སྟོང་ཙམ་དང་ལྷན་ཅིག །རྒྱལ་ཕྲན་ལྔ་སྟོང་ཙམ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་ཞི་བ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Once King Radiant went before the blessed thus-gone Peaceful Action along with seven thousand ministers and five thousand master builders.

source: བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: There he bowed his head at the Blessed One’s feet and then sat off to the side.

source: བློན་པོ་བདུན་སྟོང་པོ་དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་ཞི་བའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་
en: Likewise, the seven thousand ministers bowed their heads at the blessed Thus-Gone One’s feet before sitting off to one side.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་ཞི་བ་དེ་ལ་ཚིགས་སུ་བཅད་པས་ཞུ་བ་ཞུས་པ།
en: Then they asked this of the blessed thus-gone Peaceful Action in the form of verse:

source: གཟུགས་ལ་ཇི་ལྟར་བརྟགས་ན་འདུན་པ་འདོད་ཆགས་མེད། །
en: “ ‘How should one comprehend form, to have no yearning and desire?

source: ཇི་ལྟར་གཟུགས་ལས་བྱུང་ན་ཕུང་གྲོལ་མྱ་ངན་མེད། །
en: How can one go beyond form, to be free of the aggregates, beyond suffering?

source: གཟུགས་ལས་བྱུང་ན་ཇི་ལྟར་ཕུང་པོ་སོ་སོར་རྟོག །
en: Going beyond form, how should one understand the aggregates?

source: ཇི་ལྟར་གཟུགས་དང་བྲལ་ཞིང་ཞི་བ་ཇི་ལྟར་ཚོལ།
en: How to become free of form, and how to search for peace?

source: ཇི་ལྟར་བྱ་རྒྱལ་ཇི་ལྟར་སྒོང་སྦུབས་བྱ་བཞིན་དུ། །ཡུལ་ལ་མཐོང་བ་བཅོམ་ནས་དཔའ་བོ་ཇི་ལྟར་མཆི། །
en: “ ‘Like the king of birds inside an egg, How should one be brave once any vision of objects has been overcome?

source: འཇིག་རྟེན་མི་དག་མེ་གསུམ་གྱིས་ནི་གདུངས་པ་ན། །མུན་ཀུན་བཅོམ་ནས་ཇི་ལྟར་མྱ་ངན་འདས་པར་མཆི། །
en: Tormented by the three fires, how can the people of the world Overcome all darkness and reach nirvāṇa?

source: ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་ཇི་ལྟར་ཡོངས་སུ་གཏོང་། །
en: “ ‘How to give up the aggregates, elements, and sense sources?

source: མེ་འབར་ཞི་བ་ལྟ་བུ་དབང་པོ་ཇི་ལྟར་དོར། །
en: How to abandon the faculties, like putting out a blazing fire?

source: ལྷར་བཅས་འཇིག་རྟེན་ཇི་ལྟར་བླ་མེད་ཡོན་གནས་དང་། །
en: How to become an object of worship of the whole world including the gods?

source: དཔའ་བོ་ཡོན་སྤྱོད་ཇི་ལྟར་སེམས་ཅན་རབ་ཏུ་འགྲེལ། །
en: How to liberate beings with righteous, heroic conduct?

source: མེ་ཞི་ལྟ་བུར་ཇི་ལྟར་འགྲོ་བར་འཇིགས་མ་མཆིས། །
en: “ ‘How to help beings be fearless, like putting out a fire?

source: ལས་དང་ཉོན་མོངས་ཐམས་ཅད་ཀུན་ཏུ་ཇི་ལྟར་ཞི། །
en: How to eradicate the entirety of karma and afflictions?

source: མྱ་ངན་འདས་པར་འགྲོ་བའི་སྐྱེ་བ་ཇི་ལྟར་འཐོབ། །
en: How to achieve rebirth to reach nirvāṇa?’
